app/controllers/api/entries_controller.rb

  def destroy
    entry = Entry.find(params[:id])
    entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", "145"]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 145]]