app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.order(:id)
---
SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."id" ASC

  def show
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1 ORDER BY "entries"."id" ASC  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'soirgndflgnfs.com' LIMIT 1